dance/src/DataProcessors/ОбработкаКотораяСоздает/ОбработкаКотораяСоздает.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаКотораяСоздает</name>
  <attributes>
    <name>Количество</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФИОПользователя</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ученик</name>
      <type>
        <types>CatalogRef.Ученики</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданыеЭлементы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

dance/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Зал</name>
    <type>
      <types>CatalogRef.Залы</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ученики</name>
    <attributes>
      <name>Ученик</name>
      <type>
        <types>CatalogRef.Ученики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

dance/src/DataProcessors/ОбработкаКотораяСоздает/Forms/Форма/Module.bsl
&НаСервере
Процедура СоздатьЗалНаСервере()
	НовыйЗал = Справочники.Залы.СоздатьЭлемент();
	НовыйЗал.Наименование = "Новый Зал";
	НовыйЗал.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НовыйЗал.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗал(Команда)
	СоздатьЗалНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчениковНаСервере()
	НовыйУченик = Справочники.Ученики.СоздатьЭлемент();
	НовыйУченик.Наименование = "Новый Ученик";
	НовыйУченик.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НовыйУченик.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчеников(Команда)
	ЗаполнитьУчениковНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппуНаСервере()
	НоваяГруппа = Справочники.Группы.СоздатьЭлемент();
	НоваяГруппа.Наименование = "Новая Группа";
	НоваяГруппа.Тренер = Справочники.Пользователи.НайтиПоНаименованию("Илья");
	НоваяГруппа.Зал = Справочники.Залы.НайтиПоНаименованию("Центральный");
	НоваяГруппа.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НоваяГруппа.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	СоздатьГруппуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователяНаСервере()
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = "Новый Пользователь";
	НовыйПользователь.Записать();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

    НоваяСтрока = ОбработкаОбъект.ФИОПользователя.Добавить();
    НоваяСтрока.СозданыеЭлементы = НовыйПользователь.Наименование;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПользователя(Команда)
	ЗаполнитьПользователяНаСервере();
КонецПроцедуры
